local E, C = unpack(select(2, ...))
if not C["raid"].raidaurawatch == true then return end


E.buffids = {
		PRIEST = {
			{6788, "TOPLEFT", {1, 0, 0}, true}, -- 虛弱靈魂
			{48113, "TOPRIGHT", {0.2, 0.7, 0.2}}, -- 癒合禱言
			{48068, "BOTTOMLEFT", {0.4, 0.7, 0.2}}, -- 恢復
			{48066, "BOTTOMRIGHT", {0.81, 0.85, 0.1}, true}, -- 真言術:盾
		},
		DRUID = {
			{48440, "TOPLEFT", {0.8, 0.4, 0.8}}, -- 回春術
			{48443, "TOPRIGHT", {0.2, 0.8, 0.2}}, -- 癒合
			{48450, "BOTTOMLEFT", {0.4, 0.8, 0.2}}, -- 生命之花
			{53249, "BOTTOMRIGHT", {0.8, 0.4, 0}}, -- 野性痊癒
		},
		PALADIN = {
			{53563, "TOPLEFT", {0.7, 0.3, 0.7}}, -- 聖光信標
			{53601, "TOPRIGHT", {0.4, 0.7, 0.2}}, -- 崇聖護盾
		},
		SHAMAN = {
			{61301, "TOPLEFT", {0.7, 0.3, 0.7}}, -- 激流
			{49284, "TOPRIGHT", {0.2, 0.7, 0.2}}, -- 大地之盾
			{16237, "BOTTOMLEFT", {0.4, 0.7, 0.2}}, -- 先祖堅韌
			{52000, "BOTTOMRIGHT", {0.7, 0.4, 0}}, -- 大地生命
		},
		ALL = {
			-- {2893, "RIGHT", {0, 1, 0}}, -- 驅毒術
			{23333, "LEFT", {1, 0, 0}}, -- 戰歌旗幟
		},
	}
	
	-- Raid debuffs
	E.debuffids = {
		-- Naxxramas
		27808, -- Frost Blast
		32407, -- Strange Aura
		28408, -- Chains of Kel'Thuzad

		-- Ulduar
		66313, -- Fire Bomb
		63134, -- Sara's Blessing
		62717, -- Slag Pot
		63018, -- Searing Light
		64233, -- Gravity Bomb
		63495, -- Static Disruption

		-- Trial of the Crusader
		66406, -- Snobolled!
		67574, -- Pursued by Anub'arak
		68510, -- Penetrating Cold
		67651, -- Arctic Breath
		68127, -- Legion Flame
		67049, -- Incinerate Flesh
		66869, -- Burning Bile
		66823, -- Paralytic Toxin


		-- 冰冠城塞
		71224, -- 突變感染
		71822, -- 暗影共鳴
		70447, -- 暴躁軟泥怪黏著
		72293, -- 墮落勇士印記
		72448, -- 血魄符文
		71473, -- 血腥女王精華
		71624, -- 極樂斬擊
		70923, -- 失控狂亂
		70588, -- 鎮壓
		71738, -- 腐敗
		71733, -- 酸液爆發
		72108, -- 死亡凋零
		71289, -- 支配心智
		69762, -- 無束魔法
		69651, -- 致傷打擊
		69065, -- 被刺穿
		71218, -- 污穢毒氣
		72442, -- 沸血
		72769, -- 血魄氣息
		69279, -- 氣體孢子
		70949, -- 血腥女王精華
		72151, -- 狂亂嗜血
		71474, -- 狂亂嗜血
		71340, -- 暗殞契印
		72985, -- 群聚暗影
		71267, -- 群聚暗影
		71264, -- 群聚暗影
		71807, -- 激光
		70873, -- 翡翠精力
		71941, -- H绿龙-扭曲梦魇-感谢网友Kio提供。
		71283, -- 臟汁噴灑
		69766, -- 不穩定
		70126, -- 冰霜信標
		70157, -- 寒冰之墓
		71056, -- 冰息術
		70106, -- 徹骨之寒
		70128, -- 秘能連擊
		73785, -- 亡域瘟疫
		73779, -- 寄生
		73800, -- 靈魂厲嘯
		73797, -- 靈魂收割者
		73708, -- 汙染
		74322, -- 割取的靈魂
		72855, -- H教授疾病

		-- 晶紅聖所
		74502, -- 衰弱烙印
		75887, -- 熾炎光環
		74562, -- 熾熱燃灼
		74567, -- 燃灼印記
		74792, -- 靈魂耗損
		74795, -- 耗損印記		
		
		-- Other debuff
		6215, -- Fear
		67479, -- Impale
		--20375, -- 骑士命令圣印测试
	}